src/cf/Documents/уатЗаявкаНаРасходованиеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатЗаявкаНаРасходованиеДС</Name>
			<BasedOn>
				<xr:Item>Document.уатСчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.уатАвансовыйОтчет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатЗаявкиНаРасходованиеДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Comment>Касса или банковский счет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийЗаявкиНаРасходование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>Дата входящего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>Номер входящего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
					<Comment>Расшифровка платежа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>Договор контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Comment>Кратность взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Comment>Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Comment>Статья движения денежных средств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>Сумма взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>Сумма платежа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/уатФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатФормыОплаты</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агрегатор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийЗаявкиНаРасходование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийЗаявкиНаРасходование</Name>
			<Comment>Виды операций заявки на расходование (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасходДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийПоступлениеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийПоступлениеДС</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеНаличными</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеБезналичными</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатЗаявкаНаРасходованиеДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область Переменные_формы

&НаКлиенте
Перем СтрокаПлатеж;

&НаКлиенте
Перем ОтветПередЗаписью;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Организация) Тогда
		ПриИзмененииОрганизацииНаСервере();
	КонецЕсли;
	
	мВалютаРегламентированногоУчета = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Объект.Организация);
	ПараметрыЗначениеКопирования = Параметры.ЗначениеКопирования;
	
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.ЦФО, "Объект.Организация");
	
	// уатСогласованиеДокументов
	ИмяДокументаСогласование = "ЗаявкаНаРасходованиеДС";
	уатСогласованиеДокументовСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец уатСогласованиеДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
	КонецЕсли;
	
	Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
		
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если Параметры.Ключ.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ	
		
		Объект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уатФормыОплаты.Наличные");
		
		Если Не ЗначениеЗаполнено(Объект.БанковскийСчетКасса) Тогда
			Объект.БанковскийСчетКасса = ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");
			
			Если Объект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уатФормыОплаты.Наличные") Тогда
				мКасса = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация, "ОсновнаяКасса");
			
				Если мКасса <> Неопределено Тогда
					ВалютаКассы = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(мКасса, "ВалютаДенежныхСредств");
				Иначе
					ВалютаКассы = Неопределено;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
					Объект.БанковскийСчетКасса = мКасса;
					Объект.ВалютаДокумента     = ВалютаКассы;
				ИначеЕсли ВалютаКассы = Объект.ВалютаДокумента Тогда
					Объект.БанковскийСчетКасса = мКасса;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыЗначениеКопирования.Пустая() Тогда
			ЗаполнитьКонтрагента();
		КонецЕсли;
		
	КонецЕсли;
	
	// уатСогласованиеДокументов
	уатСогласованиеДокументовКлиент.ОбновитьСтатусСогласования(ЭтотОбъект);
	// Конец уатСогласованиеДокументов
	
	СтараяВалютаДокумента = Объект.ВалютаДокумента;
	
	// Установить видимость реквизитов и заголовков колонок.
	Если Объект.РасшифровкаПлатежа.Количество()>1 Тогда
		СпособРедактирования = 1;
	Иначе
		СпособРедактирования = 0;
	КонецЕсли;
	
	Элементы.Номенклатура.Доступность = ЗначениеЗаполнено(Объект.СтатьяОборотов);
	Элементы.Номенклатура.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура, СправочникСсылка.уатТС, СправочникСсылка.уатМоделиТС");
	
	УстановитьОграничениеТипаСделка();
	УстановитьВидимость();
	
	РассчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// уатСогласованиеДокументов
	уатСогласованиеДокументовКлиент.ПослеЗаписи(ЭтотОбъект);
	// Конец уатСогласованиеДокументов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ОтветПередЗаписью
		И (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение)
		И Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа") <> Объект.СуммаДокумента Тогда
		
		Отказ = Истина;
		
		ТекстНСТР = НСтр("en='Do not match document amount (%1) and its interpretation (%2). Recalculate amount of document?';ru='Не совпадают сумма документа (%1) и ее расшифровка (%2). Пересчитать сумму документа?'");
		ТекстНСТР = СтрШаблон(ТекстНСТР, Объект.СуммаДокумента, Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа"));
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, Новый Структура("ПараметрыЗаписи", ПараметрыЗаписи)),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОтветПередЗаписью = Истина;
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		Записать(ДополнительныеПараметры.ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// уатСогласованиеДокументов
	уатСогласованиеДокументовКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр);
	// Конец уатСогласованиеДокументов
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если флВопросЗакрытиеФормы Тогда
		Отказ = Истина;
		Оповещ = Новый ОписаниеОповещения("ПередЗакрытиемВопрос", ЭтотОбъект);
		ПоказатьВопрос(Оповещ, "При проверке корректности заполнения документа возникли предупреждения!
			|Продолжить закрытие формы?", РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОперацияОплатаПоставщику(Команда)
	Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику");
	ВидОперацииПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПрочиеРасчетыСКонтрагентами(Команда)
	Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами");
	ВидОперацииПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОперацияРасходДенежныхСредствПрочее(Команда)
	Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ПрочийРасходДенежныхСредств");
	ВидОперацииПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОперацияВыдачаПодотчетнику(Команда)
	Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ВыдачаПодотчетнику");
	ВидОперацииПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении()
	Если ЗначениеЗаполнено(Объект.Контрагент) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ВыдачаПодотчетнику") Тогда
		Объект.Контрагент = Неопределено;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПодотчетноеЛицо) И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ВыдачаПодотчетнику") Тогда
		Объект.ПодотчетноеЛицо = Неопределено;
	КонецЕсли;
		
	Объект.РасшифровкаПлатежа.Очистить();
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
	
	СпособРедактирования = 0;
	
	УстановитьФокус();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораСделки(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента) Тогда 
		СтандартнаяОбработка = Ложь;
		
		Если СпособРедактирования = 0 Тогда 
			ПолеДанных = "Элементы.РасшифровкаПлатежа.ТекущиеДанные.Сделка";
		Иначе 
			ТекСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
			Если Не ТекСтрока = Неопределено Тогда 
				ИндексСтроки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор()).НомерСтроки-1;
				ПолеДанных = "Объект.РасшифровкаПлатежа["+Формат(ИндексСтроки,"ЧГ=0")+"].Сделка";
			Иначе 
				ПолеДанных = "Объект.РасшифровкаПлатежа";
			КонецЕсли;
		КонецЕсли;
		
		ТекстНСТР = НСтр("en='You must select the contract of counterparty.';ru='Необходимо выбрать договор контрагента.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,, ПолеДанных);
		
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента) Тогда
		СтандартнаяОбработка = Ложь;
		ТекстНСТР = НСтр("en='Not selected counterparty contract!';ru='Не выбран договор контрагента!'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	КонецЕсли;
	// Тип выбираемого значения зависит от договора.
	ВидДоговораКонтрагента = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВидДоговора");
	Если ВидДоговораКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее") Тогда
		СтандартнаяОбработка = Ложь;
		ТекстНСТР = НСтр("en='Under contracts with  type ""other"", there are no payments on deals!';ru='По договорам с видом ""Прочее"" не ведутся взаиморасчеты по сделкам!'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипаСделка()
	ВедениеВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВедениеВзаиморасчетов");
	Если ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным") Тогда
		Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатПоступлениеТоваровУслуг");
		Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатПоступлениеТоваровУслуг");
		Элементы.РасшифровкаПлатежаСделка1.Заголовок = НСтр("en='Income';ru='Поступление'");
		Элементы.РасшифровкаПлатежаСделка1.Подсказка = НСтр("en='Receipt of materials and services';ru='Поступление материалов и услуг'");
		
		мсвПараметрыВыбора = Новый Массив;
		мсвПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ДоговорКонтрагента", СтрокаПлатеж.ДоговорКонтрагента));
		Элементы.РасшифровкаПлатежаСделка.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		Элементы.РасшифровкаПлатежаСделка1.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		
	ИначеЕсли ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам") Тогда
		Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатСчетНаОплатуПоставщика");
		Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатСчетНаОплатуПоставщика");
		Элементы.РасшифровкаПлатежаСделка1.Заголовок = НСтр("en='Invoice';ru='Счет на оплату'");
		Элементы.РасшифровкаПлатежаСделка1.Подсказка = НСтр("en='Invoice for supplier';ru='Счет на оплату поставщика'");
		
		мсвПараметрыВыбора = Новый Массив;
		мсвПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ДоговорКонтрагента", СтрокаПлатеж.ДоговорКонтрагента));
		Элементы.РасшифровкаПлатежаСделка.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		Элементы.РасшифровкаПлатежаСделка1.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		
	ИначеЕсли ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС") Тогда
		Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя");
		Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя");
		Элементы.РасшифровкаПлатежаСделка1.Заголовок = НСтр("en='Order for trucking';ru='Заказ на ТС'");
		Элементы.РасшифровкаПлатежаСделка1.Подсказка = НСтр("en='Order for trucking';ru='Заказ на ТС'");
		
		
		мсвЗаказыДляОтбора = уатОбщегоНазначения_проф.ПолучитьЗаказыПоДоговору(СтрокаПлатеж.ДоговорКонтрагента, Ложь);
		
		мсвПараметрыВыбора = Новый Массив;
		мсвПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", мсвЗаказыДляОтбора));
		Элементы.РасшифровкаПлатежаСделка.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		Элементы.РасшифровкаПлатежаСделка1.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		
	Иначе
		Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
		Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
		Элементы.РасшифровкаПлатежаСделка1.Заголовок = НСтр("en='Deal';ru='Сделка'");
		Элементы.РасшифровкаПлатежаСделка1.Подсказка = НСтр("en='Invoice for buyer or Receipt of materials and services';ru='Счет на оплату покупателю или Поступление материалов и услуг'");
		
		мсвПараметрыВыбора = Новый Массив;
		Элементы.РасшифровкаПлатежаСделка.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		Элементы.РасшифровкаПлатежаСделка1.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьКурсКратностьДокумента();
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОрганизации();
	ПриИзмененииОрганизацииНаСервере();
	
	// уатСогласованиеДокументов
	уатСогласованиеДокументовКлиент.ОрганизацияПодразделениеПриИзменении(ЭтотОбъект);
	// Конец уатСогласованиеДокументов
	
	УстановитьФокус();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОрганизацииНаСервере()

	Если Объект.ФормаОплаты = Перечисления.уатФормыОплаты.Безналичные
		ИЛИ Объект.ФормаОплаты = Перечисления.уатФормыОплаты.ПлатежнаяКарта Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчетКасса) 
			ИЛИ (ПолучитьОрганизациюПоСчетуНаСервере(Объект.БанковскийСчетКасса) <> Объект.Организация) Тогда
			
			Объект.БанковскийСчетКасса = ПолучитьСчетПоОрганизацииНаСервере(Объект.Организация);
		КонецЕсли;
	КонецЕсли;
	
	мВалютаРегламентированногоУчета = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Объект.Организация);
	ОбновитьКурсКратностьДокумента();

КонецПроцедуры

&НаСервере
Функция ПолучитьСчетПоОрганизацииНаСервере(ТекОрганизация)

	Если ЗначениеЗаполнено(ТекОрганизация)
		И ТипЗнч(ТекОрганизация) = Тип("СправочникСсылка.Организации") Тогда
		
		Если уатОбщегоНазначенияТиповые.уатЕстьРеквизитСправочника("ОсновнойБанковскийСчет", "Организации") Тогда
			Возврат ТекОрганизация.ОсновнойБанковскийСчет;
		КонецЕсли;
	Иначе
		Если Метаданные.Справочники.Найти("БанковскиеСчета") <> Неопределено Тогда
			Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;

КонецФункции // ПолучитьСчетПоОрганизацииНаСервере()

&НаСервере
Функция ПолучитьОрганизациюПоСчетуНаСервере(ТекСчет)

	Если ЗначениеЗаполнено(ТекСчет) Тогда
		Возврат ТекСчет.Владелец;
	Иначе 
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецЕсли;

КонецФункции // ПолучитьОрганизациюПоСчетуНаСервере()

&НаКлиенте
Процедура ТребуетСогласованияПриИзменении(Элемент)
	
	// уатСогласованиеДокументов
	уатСогласованиеДокументовКлиент.ТребуетСогласованияПриИзменении(ЭтотОбъект);
	// Конец уатСогласованиеДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСогласованНажатие(Элемент)
	
	// уатСогласованиеДокументов
	уатСогласованиеДокументовКлиент.НадписьСогласованНажатие(ЭтотОбъект);
	// Конец уатСогласованиеДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	
	Если Объект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уатФормыОплаты.Наличные") Тогда
		Объект.БанковскийСчетКасса = Новый(Тип("СправочникСсылка.Кассы"));
	Иначе
		Объект.БанковскийСчетКасса = Новый(Тип("СправочникСсылка.БанковскиеСчета"));
	КонецЕсли;
	
	ПриИзмененииОрганизацииНаСервере();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетКассаПриИзменении(Элемент)
	
	ПересчитыватьСумму = Истина;
	
	ВалютаДенежныхСредствКассы = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.БанковскийСчетКасса, "ВалютаДенежныхСредств");
	СтараяВалюта = Объект.ВалютаДокумента;
	уатОбщегоНазначенияТиповые_проф.ПриИзмененииЗначенияКассыБанковскогоСчета(Объект.ВалютаДокумента, 
		Объект.КурсДокумента, Объект.КратностьДокумента, Объект.Дата, Объект.СуммаДокумента, ВалютаДенежныхСредствКассы,
		уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект));
	
	// Пересчитаем суммы платежей при изменении валюты
	Если ПересчитыватьСумму Тогда
		Если уатОбщегоНазначения_проф.ЕстьРасчетыСКонтрагентами(Объект.ВидОперации) Тогда
			ДопПараметрыКурсаВалюты = уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект);
			Для Каждого Строка Из Объект.РасшифровкаПлатежа Цикл
				СтрокаПлатеж = Строка;
				
				ВалютаВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
				
				Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
					ВалютаВзаиморасчетов = СтараяВалюта;
				КонецЕсли;
				
				Если ВалютаВзаиморасчетов <> Объект.ВалютаДокумента Тогда
					Строка.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(Строка.СуммаПлатежа,
						ВалютаВзаиморасчетов, Объект.ВалютаДокумента, Объект.Дата, Объект.Дата,,,,
						ДопПараметрыКурсаВалюты);
						
					Строка.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
					ПриИзмененииДоговора();
                КонецЕсли;
			КонецЦикла;
		Иначе
			СуммаДокументаПриИзменении(Неопределено);
		КонецЕсли;
		
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Иначе
		Для Каждого Строка Из Объект.РасшифровкаПлатежа Цикл
			ВалютаВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
			
			Если ВалютаВзаиморасчетов <> Объект.ВалютаДокумента Тогда
				Строка.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьФокус();
	УстановитьВидимость();
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.БанковскийСчетКасса, "Владелец");
	КонецЕсли;
	
	РассчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежа();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетКассаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уатФормыОплаты.Наличные") Тогда
		Объект.БанковскийСчетКасса = ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");
	Иначе
		Объект.БанковскийСчетКасса = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// проставим основной договор контрагента
	ПриИзмененииКонтрагента();
	ПриИзмененииДоговора();
	УстановитьФокус();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРедактированияПриИзменении(Элемент)
	
	Если Не Булево(СпособРедактирования) И Объект.РасшифровкаПлатежа.Количество()>1 Тогда
		ТекстНСТР = НСтр("en='All lines of payment decryption except the first will be deleted. Do you want to continue?';ru='Все строки расшифровки платежа, кроме первой, будут удалены. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособРедактированияПриИзмененииЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
        Возврат;
	Иначе
		Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
		СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	КонецЕсли;
	
	УстановитьВидимость();
    РассчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРедактированияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		СпособРедактирования = 1;
		Возврат;
	КонецЕсли;
	
	Пока Объект.РасшифровкаПлатежа.Количество()>1 Цикл
		СтрокаУдаления = Объект.РасшифровкаПлатежа[1];
		Объект.РасшифровкаПлатежа.Удалить(СтрокаУдаления);
	КонецЦикла;
	
	Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	//СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
	УстановитьВидимость();
    РассчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ОснованиеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ПоказатьЗначение(Неопределено, Объект.ДокументОснование);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура СтатьяОборотовПриИзменении(Элемент)
	Элементы.Номенклатура.Доступность = ЗначениеЗаполнено(Объект.СтатьяОборотов);
КонецПроцедуры

&НаКлиенте 
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// пока ограничение типа удалено, предполагается удаление этого функционала
	Заглушка = Истина;
	
	//СтандартнаяОбработка = Ложь;
	//
	//ДетПлСценарий = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.Сценарий, "ДетализацияПланирования");
	//Если ДетПлСценарий = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.ТС") Тогда
	//	ПараметрыОткрытия = Новый Структура;
	//	Если ЗначениеЗаполнено(Объект.Номенклатура) И ТипЗнч(Объект.Номенклатура)=Тип("СправочникСсылка.уатТС") Тогда
	//		ПараметрыОткрытия.Вставить("ТекущаяСтрока", Объект.Номенклатура);
	//	КонецЕсли;
	//	ФормаВыбора = ОткрытьФорму("Справочник.уатТС.ФормаВыбора", ПараметрыОткрытия, Элемент);
	//ИначеЕсли ДетПлСценарий = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.МодельТС") Тогда
	//	ПараметрыОткрытия = Новый Структура;
	//	Если ЗначениеЗаполнено(Объект.Номенклатура) И ТипЗнч(Объект.Номенклатура)=Тип("СправочникСсылка.уатМоделиТС") Тогда
	//		ПараметрыОткрытия.Вставить("ТекущаяСтрока", Объект.Номенклатура);
	//	КонецЕсли;
	//	ФормаВыбора = ОткрытьФорму("Справочник.уатМоделиТС.ФормаВыбора", ПараметрыОткрытия, Элемент);
	//Иначе
	//	ПараметрыОткрытия = Новый Структура;
	//	Если ЗначениеЗаполнено(Объект.Номенклатура) И ТипЗнч(Объект.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
	//		ПараметрыОткрытия.Вставить("ТекущаяСтрока", Объект.Номенклатура);
	//	КонецЕсли;
	//	ФормаВыбора = ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОткрытия, Элемент);
	//КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаДоговорКонтрагентаПриИзменении(Элемент)
	
	ПриИзмененииДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		СтандартнаяОбработка = Ложь;
		
		ТекСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
		Если Не ТекСтрока = Неопределено Тогда 
			ИндексСтроки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор()).НомерСтроки-1;
			ПолеДанных = "Объект.РасшифровкаПлатежа["+Формат(ИндексСтроки,"ЧГ=0")+"].ДоговорКонтрагента";
		Иначе 
			ПолеДанных = "Объект.РасшифровкаПлатежа";
		КонецЕсли;
		
		ТекстНСТР = НСтр("en='You must select a counterparty.';ru='Необходимо выбрать контрагента.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,ПолеДанных);
		
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком");
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ЗначениеОтбора", Объект.ВалютаДокумента);
	СтруктураДопПараметров = Новый Структура("ВалютаВзаиморасчетов", СтруктураОтбора);
	уатОбщегоНазначенияТиповыеКлиент.уатНачалоВыбораЗначенияДоговораКонтрагента(Объект, ЭтотОбъект, Элемент, Объект.Контрагент, 
		Элементы.РасшифровкаПлатежа.ТекущиеДанные.ДоговорКонтрагента, мВидДоговора, СтандартнаяОбработка, СтруктураДопПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВидДоговораДоступныеЗначения = Новый Массив;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком");
	КонецЕсли;
	ВидДоговораДоступныеЗначения.Добавить(мВидДоговора);
	
	ПараметрыФормы = Новый Структура(); 
	ПараметрыФормы.Вставить("Владелец", Объект.Контрагент);
	ПараметрыФормы.Вставить("ВидДоговораДоступныеЗначения", ВидДоговораДоступныеЗначения);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСделкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораСделки(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПлатежаПриИзменении(Элемент)
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПередУдалением(Элемент, Отказ)
	
	Если Объект.РасшифровкаПлатежа.Количество()=1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	УстановитьОграничениеТипаСделка();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриАктивизацииСтроки(Элемент)
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСделка1ПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.Сделка) Тогда
		ВедениеВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВедениеВзаиморасчетов");
		Если (ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам")
			ИЛИ ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным")) Тогда
			
			СделкаСтруктура = ПолучитьРеквизитыСделки(ТекДанные.Сделка);
			ТекДанные.КратностьВзаиморасчетов	 = СделкаСтруктура.КратностьВзаиморасчетов;
			ТекДанные.КурсВзаиморасчетов		 = СделкаСтруктура.КурсВзаиморасчетов;
			ТекДанные.СуммаПлатежа				 = СделкаСтруктура.СуммаПлатежа;

			Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы   

// уатУправлениеАвтотранспортом.МодификацияКонфигурации
&НаКлиенте
Процедура Подключаемый_уатВыполнитьКоманду(Команда)
	
	уатМодификацияКонфигурацииКлиентПереопределяемый.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры
// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ПодборВРасшифровку(Команда)
	ПодборПоЗадолженности(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПодборДоговора(Команда)
	ПодборПоЗадолженности(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоЗадолженности(флБезРазбиения)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ТекстНСТР = НСтр("en='You must specify the counterparty';ru='Необходимо указать контрагента'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,"Объект.Контрагент");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументСсылка",              Объект.Ссылка);
	СтруктураПараметров.Вставить("КурсДокумента",               Объект.КурсДокумента);
	СтруктураПараметров.Вставить("КратностьДокумента",          Объект.КратностьДокумента);
	СтруктураПараметров.Вставить("ТипЗадолженности",            "<0");
	СтруктураПараметров.Вставить("Контрагент",                  Объект.Контрагент);
	СтруктураПараметров.Вставить("БанковскийСчетКасса",         Объект.БанковскийСчетКасса);
	СтруктураПараметров.Вставить("Организация",                 Объект.Организация);
	СтруктураПараметров.Вставить("ВалютаДокумента",             Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("ДатаДок",                     Объект.Дата);
	СтруктураПараметров.Вставить("СуммаДляПодбора",             Объект.СуммаДокумента);
	СтруктураПараметров.Вставить("ПлатежПоСуммеВзаиморасчетов", Истина);
	СтруктураПараметров.Вставить("ЕстьПодбор",                  Истина);
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе",          флБезРазбиения);
	
	мсвСтрокРасшифровка = Новый Массив;
	Для Каждого ТекСтрока Из Объект.РасшифровкаПлатежа Цикл
		ТекВедениеВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(ТекСтрока.ДоговорКонтрагента, "ВедениеВзаиморасчетов");
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДоговорКонтрагента)
			ИЛИ ТекСтрока.СуммаПлатежа = 0
			ИЛИ (ТекВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным")
			ИЛИ ТекВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам")
			ИЛИ ТекВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС"))
			И НЕ ЗначениеЗаполнено(ТекСтрока.Сделка) Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрока = Новый Структура("ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, СуммаВзаиморасчетов, СуммаПлатежа, Сделка");
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
		НовСтрока.Вставить("Валюта", уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(ТекСтрока.ДоговорКонтрагента, "ВалютаВзаиморасчетов"));
		мсвСтрокРасшифровка.Добавить(НовСтрока);
	КонецЦикла;
	СтруктураПараметров.Вставить("РасшифровкаПлатежа", мсвСтрокРасшифровка);
	
	ОповещОЗакрытии = Новый ОписаниеОповещения("ПодборПоЗадолженностиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.уатПодборПараметровРасшифровкиПлатежа.Форма.ФормаПодбораЗадолженностей", СтруктураПараметров, ЭтотОбъект,,,, ОповещОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоЗадолженностиЗавершение(Результат, ДопПараметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РасшифровкаПлатежа.Очистить();
	Для Каждого СтруктураСтроки Из Результат.РасшифровкаПлатежа Цикл
		СтрокаРасшифровка                         = Объект.РасшифровкаПлатежа.Добавить();
		СтрокаРасшифровка.ДоговорКонтрагента      = СтруктураСтроки.ДоговорКонтрагента;
		СтрокаРасшифровка.Сделка                  = СтруктураСтроки.Сделка;
		СтрокаРасшифровка.СуммаПлатежа            = СтруктураСтроки.СуммаПлатежа;
		СтрокаРасшифровка.СуммаВзаиморасчетов     = СтруктураСтроки.СуммаВзаиморасчетов;
		СтрокаРасшифровка.КурсВзаиморасчетов      = СтруктураСтроки.КурсВзаиморасчетов;
		СтрокаРасшифровка.КратностьВзаиморасчетов = СтруктураСтроки.КратностьВзаиморасчетов;
	КонецЦикла;
		
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	Иначе
		СтрокаПлатеж = Объект.РасшифровкаПлатежа[0];
	КонецЕсли;
	
	Если Объект.РасшифровкаПлатежа.Количество() > 1 Тогда
		СпособРедактирования = 1;
	Иначе
		СпособРедактирования = 0;
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	РассчитатьИтоги();
	
	УстановитьФокус();
	УстановитьВидимость();
	УстановитьОграничениеТипаСделка();
	
	Модифицированность = Истина;
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Проверяет установленные курсы валют документа перед пересчетом сумм
// Нулевые курсы устанавливаются в 1
//
&НаКлиенте
Процедура ПроверкаКурсовВалют(СтрокаПлатеж=Неопределено)
	
	Объект.КурсДокумента      = ?(Объект.КурсДокумента=0, 1, Объект.КурсДокумента);
	Объект.КратностьДокумента = ?(Объект.КратностьДокумента=0, 1, Объект.КратностьДокумента);
	
	Если Не СтрокаПлатеж = Неопределено Тогда
		СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов=0, 1, СтрокаПлатеж.КурсВзаиморасчетов);
		СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов=0, 1, СтрокаПлатеж.КратностьВзаиморасчетов);
	КонецЕсли;
	
КонецПроцедуры // ПроверкаКурсовВалют()

// Процедура устанавливает видимость для тех колонок в табличной части 
// "Товары", видимость которых определяется реквизитами документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура УстановитьВидимость()
	
	ВидОперации_ОплатаПоставщику = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику"));
	ВидОперации_ПрочиеРасчеты = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами"));
	ВидОперации_РасходПрочий = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ПрочийРасходДенежныхСредств"));
	ВидОперации_ВыдачаПодотчетнику = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ВыдачаПодотчетнику"));
	
	Элементы.ФормаОперацияОплатаПоставщику.Пометка            = ВидОперации_ОплатаПоставщику;
	Элементы.ФормаОперацияПрочиеРасчетыСКонтрагентами.Пометка = ВидОперации_ПрочиеРасчеты;
	Элементы.ФормаОперацияРасходДенежныхСредствПрочее.Пометка = ВидОперации_РасходПрочий;
	Элементы.ФормаОперацияВыдачаПодотчетнику.Пометка          = ВидОперации_ВыдачаПодотчетнику;
	
	Если ВидОперации_РасходПрочий Тогда
		Элементы.СтраницаОсновная.Заголовок = НСтр("en='Other expenses';ru='Прочие расходы'");
		Элементы.СтраницаОсновнаяСтраницы.ТекущаяСтраница = Элементы.ПрочиеРасходы;
		
		Элементы.ГруппаДоговорКонтрагента.Видимость = Истина;
		Элементы.РасшифровкаПлатежаДоговорКонтрагента.Видимость = Истина;
		Элементы.СпособРедактирования.Видимость = Ложь;
			
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ПодотчетноеЛицо.Видимость = Ложь;
		
		Элементы.РасшифровкаПлатежаПодборВРасшифровку.Видимость = Истина;
			
	Иначе
		Элементы.СтраницаОсновная.Заголовок = НСтр("en='Settlements with counterparties';ru='Расчеты с контрагентами'");
		Элементы.СтраницаОсновнаяСтраницы.ТекущаяСтраница = Элементы.Расчеты;
		
		Если Булево(СпособРедактирования) Тогда
			Элементы.ГруппаПлатежи.ТекущаяСтраница = Элементы.ГруппаПлатежи.ПодчиненныеЭлементы.ПлатежиПоНесколькимСделкам;
		Иначе
			Элементы.ГруппаПлатежи.ТекущаяСтраница = Элементы.ГруппаПлатежи.ПодчиненныеЭлементы.ПлатежиПоОднойСделке;
		КонецЕсли;
		
		Элементы.РасшифровкаПлатежаСделка1.Видимость = ВидОперации_ОплатаПоставщику;
		Элементы.РасшифровкаПлатежаСделка.Видимость  = ВидОперации_ОплатаПоставщику;
		
		Если ВидОперации_ВыдачаПодотчетнику Тогда
			Элементы.ГруппаРасшифровкаПлатежа.Заголовок = НСтр("en='Issuance detail';ru='Расшифровка выдачи'");
			
			Элементы.ГруппаДоговорКонтрагента.Видимость = Ложь;
			Элементы.РасшифровкаПлатежаДоговорКонтрагента.Видимость = Ложь;
			Элементы.СпособРедактирования.Видимость = Истина;
			
			Элементы.Контрагент.Видимость = Ложь;
			Элементы.ПодотчетноеЛицо.Видимость = Истина;
			
			Элементы.РасшифровкаПлатежаПодборВРасшифровку.Видимость = Ложь;
			
		Иначе
			Элементы.ГруппаРасшифровкаПлатежа.Заголовок = НСтр("en='Decoding of payment';ru='Расшифровка платежа'");
			
			Элементы.ГруппаДоговорКонтрагента.Видимость = Истина;
			Элементы.РасшифровкаПлатежаДоговорКонтрагента.Видимость = Истина;
			Элементы.СпособРедактирования.Видимость = Истина;
			
			Элементы.Контрагент.Видимость = Истина;
			Элементы.ПодотчетноеЛицо.Видимость = Ложь;
			
			Элементы.РасшифровкаПлатежаПодборВРасшифровку.Видимость = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уатФормыОплаты.Наличные") Тогда 
		Элементы.БанковскийСчетКасса.Заголовок = НСтр("en='Cash fund';ru='Касса'");
		Элементы.БанковскийСчетКасса.Подсказка = НСтр("en='Cash fund from which expenditure of funds is planned';ru='Касса из которой планируется расход денежных средств'");
	Иначе
		Элементы.БанковскийСчетКасса.Заголовок = НСтр("en='Bank account';ru='Банк. счет'");
		Элементы.БанковскийСчетКасса.Подсказка = НСтр("en='Bank account from which it is planned to write off money';ru='Банковский счет с которого планируется списание денежных средств'");
	КонецЕсли;
	
	Если СпособРедактирования = 0 Тогда
		ВедениеВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВедениеВзаиморасчетов");
		Если ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам")
			ИЛИ ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным")
			ИЛИ ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС") Тогда
			
			Элементы.РасшифровкаПлатежаСделка1.АвтоОтметкаНезаполненного = Истина;
		Иначе
			Элементы.РасшифровкаПлатежаСделка1.ОтметкаНезаполненного = Ложь;
			Элементы.РасшифровкаПлатежаСделка1.АвтоОтметкаНезаполненного = Ложь;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры // УстановитьВидимость()

// Возвращает фокус на строку ТЧ "Расшифровка платежа" при его потере в режиме редактирования
// одиночного платежа.
&НаКлиенте
Процедура УстановитьФокус()
	
	Если Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Неопределено Тогда
		Элементы.РасшифровкаПлатежа.ТекущаяСтрока = СтрокаПлатеж.ПолучитьИдентификатор();
	КонецЕсли;          
	Если Не Булево(СпособРедактирования) Тогда 
		Элементы.РасшифровкаПлатежа.ТекущаяСтрока = СтрокаПлатеж.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры // УстановитьФокус()

// Процедура выполняет необходимые действия при изменении договора взаиморасчетов
// с контрагентом.
//
&НаКлиенте
Процедура ПриИзмененииДоговора()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "Организация");
	КонецЕсли;
	
	СтрокаПлатеж.Сделка = Неопределено;
	
	ВалютаВзаиморасчетовПоДоговору = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
	СтруктураКурсаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаВзаиморасчетовПоДоговору,
		Объект.Дата, уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект));
	
	СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Контрагент = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "Владелец");
	КонецЕсли;
	
	УстановитьОграничениеТипаСделка();
	УстановитьВидимость();
		
КонецПроцедуры // ПриИзмененииДоговора()

&НаКлиенте
Процедура ПриИзмененииКонтрагента()
	
	Объект.РасшифровкаПлатежа.Очистить();
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		СтрокаПлатеж.ДоговорКонтрагента = Неопределено;
		
	Иначе
		СписокДоговоров = Новый СписокЗначений;
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами") Тогда
			СписокДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"));
		ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику") Тогда
			СписокДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
		КонецЕсли;
		
		СтруктураПараметровДляПолученияДоговора = Новый Структура;
		СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДоговоров);
		СтруктураПараметровДляПолученияДоговора.Вставить("ВалютаВзаиморасчетовДоговора", Объект.ВалютаДокумента);
		
		СтрокаПлатеж.ДоговорКонтрагента = уатОбщегоНазначенияТиповыеСервер.уатПолучитьДоговорПоОрганизацииИКонтрагенту(Объект.Организация, 
			Объект.Контрагент, СтруктураПараметровДляПолученияДоговора);
		
	КонецЕсли;
	
	СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
	
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		КонтрагентНаименованиеПолное = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.Контрагент, "НаименованиеПолное");
		КонтрагентНаименование       = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.Контрагент, "Наименование");
		Объект.ПринятоОт = ?(ПустаяСтрока(КонтрагентНаименованиеПолное), КонтрагентНаименование, КонтрагентНаименованиеПолное);
		
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииКонтрагента

&НаКлиенте
Процедура ПриИзмененииОрганизации()
	
	ВладелецБС = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.БанковскийСчетКасса, "Владелец");
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПоступлениеДС.ПоступлениеНаличными") 
		И (Объект.БанковскийСчетКасса = Неопределено Или ВладелецБС <> Объект.Организация) Тогда
			Объект.БанковскийСчетКасса = ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПоступлениеДС.ПоступлениеБезналичными") 
		И (Объект.БанковскийСчетКасса = Неопределено Или ВладелецБС <> Объект.Организация) Тогда
			Объект.БанковскийСчетКасса = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииОрганизации()

// Процедура рассчитывает сумму платежа по сумме взаиморасчетов.
//
&НаКлиенте
Процедура РассчитатьСуммуПлатежа()
	
	ПроверкаКурсовВалют(СтрокаПлатеж);
	
	ВалютаВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
	
	Если ВалютаВзаиморасчетов <> Объект.ВалютаДокумента Тогда
		СтрокаПлатеж.СуммаПлатежа = 0;
	КонецЕсли;
		
	Если Объект.РасшифровкаПлатежа.Количество()=1 Тогда
		 СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
	КонецЕсли;
	
КонецПроцедуры // РассчитатьСуммуПлатежа()

// Процедура выполняет заполнение реквизита Контрагент значением по умолчанию.
//
&НаКлиенте
Процедура ЗаполнитьКонтрагента()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат;
	КонецЕсли;
	СписокЗначений = Новый СписокЗначений;
	ВремКонтрагент = Неопределено;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Контрагент = ВремКонтрагент;
		
		// проставим основной договор контрагента
		ПриИзмененииКонтрагента();
		ПриИзмененииДоговора();
		УстановитьФокус();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьКонтрагента()

&НаКлиенте
Процедура РассчитатьИтоги()
	Элементы.РасшифровкаПлатежаСуммаПлатежа.ТекстПодвала = Формат(Объект.СуммаДокумента,"ЧЦ=12; ЧДЦ=2") + " " + Строка(Объект.ВалютаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемВопрос(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		флВопросЗакрытиеФормы = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыСделки(Сделка)
	
	СтруктураСделка = Новый Структура("КратностьВзаиморасчетов, КурсВзаиморасчетов, СуммаПлатежа");
	СтруктураСделка.КратностьВзаиморасчетов	 = Сделка.КратностьВзаиморасчетов;
	СтруктураСделка.КурсВзаиморасчетов		 = Сделка.КурсВзаиморасчетов;
	СтруктураСделка.СуммаПлатежа			 = Сделка.СуммаДокумента;
	
	Возврат СтруктураСделка;
	
КонецФункции

&НаСервере
Процедура ОбновитьКурсКратностьДокумента()
	СтруктураКурс = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата, Объект);
	Объект.КурсДокумента = СтруктураКурс.Курс;
	Объект.КратностьДокумента = СтруктураКурс.Кратность;
	
	Для Каждого ТекСтрока Из Объект.РасшифровкаПлатежа Цикл
		СтруктураКурсаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			ТекСтрока.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.Дата, Объект);
		
		ТекСтрока.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		ТекСтрока.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ИсполняемаяЧастьМодуля

ОтветПередЗаписью = Ложь;

#КонецОбласти
